title: Veeam Password Recovery Script Registry Reads
id: e2f9c3d4-b5a6-4e7f-8c1d-2f3a4b5c6d7e
status: experimental
description: Detect registry read on key knwon to stoe login to veeam credential database
author: fab
date: '2025/05/06'
references:
  - https://attack.mitre.org/techniques/T1552/003/
  - https://thedfirreport.com/2025/02/24/confluence-exploit-leads-to-lockbit-ransomware/
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4663
    winlog.event_data.ObjectName|startswith: 'HKLM\\SOFTWARE\\Veeam\\Veeam Backup and Replication\\'
    winlog.event_data.AccessList|contains: 'Query Value'
  veeamprocess:
    ProcessName|startswith:
      - 'C:\Program Files\Veeam\Backup and Replication\'
  condition: selection and not veeamprocess

falsepositives:
  - Legitimate Veeam tool queries of Veeam configuration.

level: low
