title: Adexplorer Common Registry Read
id: 19eff34d-5a06-4f41-8ab8-8c22376e07cf
status: experimental
description: Detection of Adexplorer accessing common registry key
references:
    - attack.privilege_escalation
    - Huntress 2024 threat report
    - https://www.huntress.com/resources/2024-cyber-threat-report
author: Fab
date: 2025-05-17
tags:
    - attack.privilege-escalation
logsource:
    category: registry_event
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4663
        ObjectName: '\REGISTRY\MACHINE\SYSTEM\ControlSet001\Services\ldap'
    normal:
        ProcessName:
            - 'C:\Windows\System32\wbem\WmiPrvSE.exe'
            - 'C:\Windows\System32\taskhostw.exe'
    normalwild:
        ProcessName|endswith: 'MsMpEng.exe'
        ProcessName|startswith: 'C:\Windows'
    condition: selection and not (1 of normal or normalwild)
falsepositives:
    - Ldap settings change
    - Legitimate administration software
level: low
